Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/travel/rail_passenger_rights_in_the_european_union.html.txt.tmx
Source language: en
Languages: ga

source: Information on to whom a complaint can be submitted and what language can be used should be easily available to passengers
ga: Ba cheart go mbeadh fáil gan stró ag paisinéirí ar an duine ar féidir gearán a dhéanamh leo agus faoin teanga is féidir a úsáid

source: If you make a complaint you should receive a reply within 1 month
ga: Má dhéanann tú gearán, ba cheart duit aisfhreagairt a fháil laistigh de mhí amháin

source: Railway operators must publish the number of complaints they receive
ga: Ní mór d’oibreoirí iarnróid an líon gearán a fhaigheann siad a fhoilsiú

source: Information on Irish Rail’s complaint’s handling system is available on its website
ga: Tá faisnéis ar chóras láimhseála gearán Iarnród Éireann ar fáil ar a láithreán gréasáin

source: Every member state must designate a body responsible for the enforcement of this Regulation
ga: Ní mór do gach ballstát comhlacht a ainmniú atá freagrach as forfheidhmiú an Rialacháin seo

source: The National Transport Authority is the designated enforcement body (pdf) in Ireland
ga: Is iad an tÚdarás Náisiúnta Iompair an comhlacht ainmnithe forfheidhmithe (pdf) in Éirinn

source: If you are dissatisfied with an Irish railway operator’s decision and your rights under the Regulation have been denied or you did not receive a reply within 1 month of making the complaint, you can make a complaint to the National Transport Authority
ga: Mura mbíonn tú sásta le cinneadh oibreoir iarnróid Éireannach agus má sáraíodh do chearta faoin Rialachán nó mura bhfuair tú aisfhreagairt laistigh de mhí amháin tar éis an gearán a dhéanamh, is féidir leat gearán a dhéanamh leis an Údarás Náisiúnta Iompair

source: Information on making a complaint is available on its website
ga: Tá fáil ar fhaisnéis faoi ghearán a dhéanamh ar a láithreán gréasáin
